simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CRC_v2_40/API/CRC.h
/*******************************************************************************
* File Name: `$INSTANCE_NAME`.h
* Version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* Description:
*  This file provides constants and parameter values for the CRC component.
*
* Note:
*  None
*
********************************************************************************
* Copyright 2008-2013, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CRC_`$INSTANCE_NAME`_H)
#define CY_CRC_`$INSTANCE_NAME`_H

#include "cyfitter.h"
    
#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif


/***************************************
*   Conditional Compilation Parameters
****************************************/

#define `$INSTANCE_NAME`_CRC_SIZE                   (`$Resolution`u)
#define `$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE   (`$TimeMultiplexing`u)


/***************************************
*       Type defines
***************************************/

/* Structure to save registers before go to sleep */
typedef struct
{
    uint8 enableState;

    /* Save D0 and D1 registers are none-retention for Panther ES1 */
    #if (CY_UDB_V0)

        #if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)
            `$RegSizeReplacementString` polynomial;

        #else
            uint32 polynomialUpper;
            uint32 polynomialLower;

        #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */

    #endif  /* End (CY_UDB_V0) */

} `$INSTANCE_NAME`_BACKUP_STRUCT;

extern uint8 `$INSTANCE_NAME`_initVar;

extern `$INSTANCE_NAME`_BACKUP_STRUCT `$INSTANCE_NAME`_backup;


/***************************************
*        Function Prototypes
****************************************/

void `$INSTANCE_NAME`_Init(void) `=ReentrantKeil($INSTANCE_NAME . "_Init")`;
void `$INSTANCE_NAME`_Enable(void) `=ReentrantKeil($INSTANCE_NAME . "_Enable")`;
void `$INSTANCE_NAME`_Start(void) `=ReentrantKeil($INSTANCE_NAME . "_Start")`;
void `$INSTANCE_NAME`_Stop(void) `=ReentrantKeil($INSTANCE_NAME . "_Stop")`;
void `$INSTANCE_NAME`_SaveConfig(void) `=ReentrantKeil($INSTANCE_NAME . "_SaveConfig")`;
void `$INSTANCE_NAME`_Sleep(void) `=ReentrantKeil($INSTANCE_NAME . "_Sleep")`;
void `$INSTANCE_NAME`_RestoreConfig(void) `=ReentrantKeil($INSTANCE_NAME . "_RestoreConfig")`;
void `$INSTANCE_NAME`_Wakeup(void) `=ReentrantKeil($INSTANCE_NAME . "_Wakeup")`;

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)    /* 8-32 bits CRC */
    `$RegSizeReplacementString` `$INSTANCE_NAME`_ReadCRC(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRC")`;
    void `$INSTANCE_NAME`_WriteSeed(`$RegSizeReplacementString` seed)  `=ReentrantKeil($INSTANCE_NAME . "_WriteSeed")`;
    `$RegSizeReplacementString` `$INSTANCE_NAME`_ReadPolynomial(void)
                                               `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomial")`;
    void `$INSTANCE_NAME`_WritePolynomial(`$RegSizeReplacementString` polynomial)
                                          `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomial")`;

#else                                    /* 33-64 bits CRC */
    uint32 `$INSTANCE_NAME`_ReadCRCUpper(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRCUpper")`;
    uint32 `$INSTANCE_NAME`_ReadCRCLower(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRCLower")`;
    void `$INSTANCE_NAME`_WriteSeedUpper(uint32 seed) `=ReentrantKeil($INSTANCE_NAME . "_WriteSeedUpper")`;
    void `$INSTANCE_NAME`_WriteSeedLower(uint32 seed) `=ReentrantKeil($INSTANCE_NAME . "_WriteSeedLower")`;
    uint32 `$INSTANCE_NAME`_ReadPolynomialUpper(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomialUpper")`;
    uint32 `$INSTANCE_NAME`_ReadPolynomialLower(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomialLower")`;
    void `$INSTANCE_NAME`_WritePolynomialUpper(uint32 polynomial)
                                                `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomialUpper")`;
    void `$INSTANCE_NAME`_WritePolynomialLower(uint32 polynomial)
                                                `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomialLower")`;

#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u) /* 8-32 bits CRC */
    void `$INSTANCE_NAME`_ResetSeedInit(`$RegSizeReplacementString` seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInit")`;
#else
    void `$INSTANCE_NAME`_ResetSeedInitUpper(uint32 seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInitUpper")`;
    void `$INSTANCE_NAME`_ResetSeedInitLower(uint32 seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInitLower")`;
#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */


/***************************************
*    Initial Parameter Constants
***************************************/

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM            (`$PolyValueLower`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED               (`$SeedValueLower`u)

#else
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM_UPPER      (`$PolyValueUpper`u)
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM_LOWER      (`$PolyValueLower`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED_UPPER         (`$SeedValueUpper`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED_LOWER         (`$SeedValueLower`u)

#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */


/***************************************
*           API Constants
***************************************/

