simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CRC_v2_40/API/CRC.h
#define `$INSTANCE_NAME`_MASK                           (`$Mask`u)


/***************************************
*             Registers
***************************************/

#define `$INSTANCE_NAME`_EXECUTE_DFF_RESET    { `$INSTANCE_NAME`_CONTROL_REG |= `$INSTANCE_NAME`_CTRL_RESET; \
    `$INSTANCE_NAME`_CONTROL_REG &= (uint8)~`$INSTANCE_NAME`_CTRL_RESET; }


#if (`$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE)
    #if (`$INSTANCE_NAME`_CRC_SIZE <= 16u)      /* 16 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_A__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 24u)      /* 24 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_B__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 32u)      /* 32 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_B__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 40u)      /* 40 bits CRC */
        /* Polynomial Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        /* Polynomial Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        /* Seed COPY Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 48u)      /* 48 bits CRC */
        /* Polynomial Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        /* Polynomial Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        /* Seed COPY Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

