simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CRC_v2_40/API/CRC.h
    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 56u)      /* 56 bits CRC */
        /* Polynom Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_D__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_D__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        /* Polynom Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_D__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_D__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_D__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_D__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_D__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_D__A0_PTR                  ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* COPY Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_D__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_D__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        /* COPY Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_D__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_D__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #else                                        /* 64 bits CRC */
        /* Polynom Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_D__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_D__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_A__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_A__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        /* Polynom Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_D__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_D__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_D__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_D__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_A__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_A__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_D__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_D__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* COPY Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_D__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_D__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_A__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_A__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        /* COPY Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_D__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_D__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
    #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 8u) */

#else
    #if (CY_PSOC3 || CY_PSOC5)
        #if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)         /* 8-32 bits CRC */
            /* Polynomial */
            #define `$INSTANCE_NAME`_POLYNOM_PTR      ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__D0_REG )
            /* Seed */
            #define `$INSTANCE_NAME`_SEED_PTR         ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__A0_REG )
            /* Seed COPY */
            #define `$INSTANCE_NAME`_SEED_COPY_PTR    ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__F0_REG )

        #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */
    #else /* PSoC4 */
        #if (`$INSTANCE_NAME`_CRC_SIZE <= 8u)         /* 8 bits CRC */
            /* Polynomial */
            #define `$INSTANCE_NAME`_POLYNOM_PTR      ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__D0_REG )
            /* Seed */
            #define `$INSTANCE_NAME`_SEED_PTR         ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__A0_REG )
            /* Seed COPY */
            #define `$INSTANCE_NAME`_SEED_COPY_PTR    ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__F0_REG )

        #elif (`$INSTANCE_NAME`_CRC_SIZE <= 16u)         /* 16 bits CRC */
            /* Polynomial */
            #define `$INSTANCE_NAME`_POLYNOM_PTR      ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__16BIT_D0_REG )
            /* Seed */
            #define `$INSTANCE_NAME`_SEED_PTR         ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__16BIT_A0_REG )
            /* Seed COPY */
            #define `$INSTANCE_NAME`_SEED_COPY_PTR    ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__16BIT_F0_REG )

        #elif (`$INSTANCE_NAME`_CRC_SIZE <= 24u)         /* 24 bits CRC */
            /* Polynomial */
            #define `$INSTANCE_NAME`_POLYNOM_PTR      ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__D0_REG )
            /* Seed */
            #define `$INSTANCE_NAME`_SEED_PTR         ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__A0_REG )
            /* Seed COPY */
            #define `$INSTANCE_NAME`_SEED_COPY_PTR    ( (`$RegDefReplacementString` *)\
                                                `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__F0_REG )

         #else                                          /* 32 bits CRC */
            /* Polynomial */
            #define `$INSTANCE_NAME`_POLYNOM_PTR      ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__32BIT_D0_REG )
            /* Seed */
            #define `$INSTANCE_NAME`_SEED_PTR         ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__32BIT_A0_REG )
            /* Seed COPY */
            #define `$INSTANCE_NAME`_SEED_COPY_PTR    ( (`$RegDefReplacementString` *)\
                                            `$INSTANCE_NAME`_`$VerilogSectionReplacementString`_CRCdp_u0__32BIT_F0_REG )

        #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */

    #endif  /* End (CY_PSOC3 || CY_PSOC5) */

