simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CRC_v2_40/API/CRC.h
#endif  /* End (`$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE) */

/* Aux control */
#if (`$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE)
    #if (`$INSTANCE_NAME`_CRC_SIZE <= 16u)      /* 8-16 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG              (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR              ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 32u)      /* 17-32 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG              (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR              ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG              (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR              ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 48u)      /* 33-48 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG              (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR              ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG              (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR              ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_REG              (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_PTR              ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__DP_AUX_CTL_REG )

    #else                                         /* 48-64 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG              (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR              ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG              (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR              ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_REG              (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_PTR              ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_D_REG              (*(reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_D_PTR              ( (reg8 *) `$INSTANCE_NAME`_b3_CRCdp_d__DP_AUX_CTL_REG )

    #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 8u) */

#else
    #if (`$INSTANCE_NAME`_CRC_SIZE <= 8u)      /* 8 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG          (*(reg8 *) `$INSTANCE_NAME`_sC8_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC8_CRCdp_u0__DP_AUX_CTL_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 16u)      /* 16 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG          (*(reg8 *) `$INSTANCE_NAME`_sC16_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC16_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG          (*(reg8 *) `$INSTANCE_NAME`_sC16_CRCdp_u1__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC16_CRCdp_u1__DP_AUX_CTL_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 24u)      /* 24-39 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG          (*(reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG          (*(reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u1__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u1__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_REG          (*(reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u2__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC24_CRCdp_u2__DP_AUX_CTL_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 32u)      /* 40-55 bits CRC */
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_REG          (*(reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_A_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u0__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_REG          (*(reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u1__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_B_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u1__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_REG          (*(reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u2__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_C_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u2__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_D_REG          (*(reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u3__DP_AUX_CTL_REG )
        #define `$INSTANCE_NAME`_AUX_CONTROL_D_PTR          ( (reg8 *) `$INSTANCE_NAME`_sC32_CRCdp_u3__DP_AUX_CTL_REG )

    #else                                         /* 56-64 bits CRC */
        /* Not supported */
    #endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 8u) */

#endif  /* End (`$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE) */

#if (CY_UDB_V0)
    #define `$INSTANCE_NAME`_CONTROL_REG                    (*(reg8 *) `$INSTANCE_NAME`_AsyncCtrl_CtrlReg__CONTROL_REG )
    #define `$INSTANCE_NAME`_CONTROL_PTR                    ( (reg8 *) `$INSTANCE_NAME`_AsyncCtrl_CtrlReg__CONTROL_REG )

#else
    #define `$INSTANCE_NAME`_CONTROL_REG                    (*(reg8 *) `$INSTANCE_NAME`_SyncCtrl_CtrlReg__CONTROL_REG )
    #define `$INSTANCE_NAME`_CONTROL_PTR                    ( (reg8 *) `$INSTANCE_NAME`_SyncCtrl_CtrlReg__CONTROL_REG )

#endif  /* End (CY_UDB_V0) */


/***************************************
*       Register Constants
***************************************/

/* Control register definitions */
#define `$INSTANCE_NAME`_CTRL_ENABLE                    (0x01u)
#define `$INSTANCE_NAME`_CTRL_RESET                     (0x02u)

/* Aux Control register definitions */
#define `$INSTANCE_NAME`_AUXCTRL_FIFO_SINGLE_REG        (0x03u)

#define `$INSTANCE_NAME`_IS_CRC_ENABLE(reg)             (((reg) & `$INSTANCE_NAME`_CTRL_ENABLE) != 0u)

#endif  /* End CY_CRC_`$INSTANCE_NAME`_H */

/* [] END OF FILE */
